In [2]:
import pandas as pd

In [69]:
df = pd.read_csv("names/yob2000.txt", names=["Name","Gender","Count"])
df

          Name Gender  Count
0        Emily      F  25956
1       Hannah      F  23082
2      Madison      F  19968
3       Ashley      F  17997
4        Sarah      F  17702
...        ...    ...    ...
29767     Zeph      M      5
29768    Zeven      M      5
29769    Ziggy      M      5
29770       Zo      M      5
29771    Zyier      M      5

[29772 rows x 3 columns]

In [90]:
df[(df["Name"]== "Aadam")]

        Name Gender  Count
26760  Aadam      M      6

In [44]:
def count_top3(years):
    list_names_for_years =list()
    for year in years:
        df = pd.read_csv('names/yob{}.txt'.format(year), names=["Name","Gender","Count"])
        list_names_for_years.append(df.sort_values('Count'))
    df_res = pd.concat(list_names_for_years).groupby('Name').sum().sort_values('Count', ascending=False).head(3)
    return df_res

In [45]:
count_top3([1900, 1950, 2000])

         Count
Name
James   111789
John    109601
Robert  101368